Tekla Open API Reference for Tekla Structures 2025
Distance.ToString Method (String, IFormatProvider, Distance.UnitType)
 Creates a string representation of the distance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToString(
	string format,
	IFormatProvider formatProvider,
	Distance.UnitType unitType
)
Public Function ToString (
	format As String,
	formatProvider As IFormatProvider,
	unitType As Distance.UnitType
) As String
Parameters
format
Type: System.String
The format string.
formatProvider
Type: System.IFormatProvider
The number format provider.
unitType
Type: Tekla.Structures.Datatype.Distance.UnitType
The unit type.
Return Value
Type: String
The string representation of the distance.
Exceptions
Exception | Condition
ArgumentException | Thrown if an invalid unit type is specified.
Examples
 This example shows how to specify a number format, a format provider and a unit type when converting a Distance instance to a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           // We can override the unit type to display the distance in inches.
           string defaultFormatInInches = distance.ToString(null, null, Distance.UnitType.Inch);
           // With the number format and culture info we can get fully customized representation.
           string customizedFormatInInches = distance.ToString("0.00", CultureInfo.InvariantCulture,
                                           Distance.UnitType.Inch);
       }
}
See Also
Reference
Distance Structure
ToString Overload
Tekla.Structures.Datatype Namespace